; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p7-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (at t0 l0-2)
    (at t1 l1-1)
    (at t2 l2-0)
    (at t3 l2-0)
    (at t4 l2-2)
    (at p0 l2-2)
    (at p1 l2-0)
    (at p2 l2-2)
    (at p3 l0-0)
    (at p4 l1-0)
    (at p5 l2-0)
    (at p6 l1-2)
    (at a0 l0-0)
    (at a1 l1-0)
)
(:goal
    (and
        (at p0 l1-2)
        (at p1 l0-1)
        (at p2 l0-0)
        (at p3 l0-0)
        (at p4 l1-1)
        (at p5 l0-0)
        (at p6 l1-1)
    )
)

  (:constraints
    (and
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p4 a0)))
      (always (not (in p4 a1)))
      (always (not (in p6 a0)))
      (always (not (in p6 a1)))
    )
  )
)

; plan
1. (drive-truck t0 l0-2 l0-1 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-1)
   goals met: 1 of 7
2. (load-truck p2 t4 l2-2)
   deleted: (at p2 l2-2)
   added: (in p2 t4)
   goals met: 1 of 7
3. (load-truck p0 t4 l2-2)
   deleted: (at p0 l2-2)
   added: (in p0 t4)
   goals met: 1 of 7
4. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 1 of 7
5. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 1 of 7
6. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 1 of 7
7. (drive-truck t4 l2-2 l2-0 c2)
   deleted: (at t4 l2-2)
   added: (at t4 l2-0)
   goals met: 1 of 7
8. (load-truck p6 t1 l1-2)
   deleted: (at p6 l1-2)
   added: (in p6 t1)
   goals met: 1 of 7
9. (load-airplane p1 a0 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 a0)
   goals met: 1 of 7
10. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 1 of 7
11. (unload-truck p2 t4 l2-0)
   deleted: (in p2 t4)
   added: (at p2 l2-0)
   goals met: 1 of 7
12. (unload-truck p0 t4 l2-0)
   deleted: (in p0 t4)
   added: (at p0 l2-0)
   goals met: 1 of 7
13. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 1 of 7
14. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 1 of 7
15. (load-airplane p5 a0 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a0)
   goals met: 1 of 7
16. (load-airplane p2 a0 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 a0)
   goals met: 1 of 7
17. (load-airplane p0 a1 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a1)
   goals met: 1 of 7
18. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 7
19. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 1 of 7
20. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 1 of 7
21. (unload-truck p6 t1 l1-1)
   deleted: (in p6 t1)
   added: (at p6 l1-1)
   goals met: 2 of 7
22. (unload-truck p4 t1 l1-1)
   deleted: (in p4 t1)
   added: (at p4 l1-1)
   goals met: 3 of 7
23. (unload-airplane p0 a1 l1-0)
   deleted: (in p0 a1)
   added: (at p0 l1-0)
   goals met: 3 of 7
24. (unload-airplane p5 a0 l0-0)
   deleted: (in p5 a0)
   added: (at p5 l0-0)
   goals met: 4 of 7
25. (unload-airplane p2 a0 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 5 of 7
26. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 5 of 7
27. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 5 of 7
28. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 5 of 7
29. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 5 of 7
30. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 5 of 7
31. (unload-truck p1 t0 l0-1)
   deleted: (in p1 t0)
   added: (at p1 l0-1)
   goals met: 6 of 7
32. (load-truck p0 t1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 6 of 7
33. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 6 of 7
34. (unload-truck p0 t1 l1-2)
   deleted: (in p0 t1)
   added: (at p0 l1-2)
   goals met: 7 of 7
